{
    "WCAG2.1": {
        "1.3.1": {
            "1": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Repeated characters should be avoided to represent lines or graphics, as the characters are read out one by one by reader software."
            },
            "2": {
                "STATUS": "ignore",
                "CATEGORY": "structure",
                "RATIONALE": "Repeated white space should be avoided to align text. Repeated white space at the end of a line usually doesn't have any function."
            },
            "3": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Underlined text is easily confused with a hyperlink. WCAG doesn't prohibit underlining but it's bad practice."
            },
            "4": {
                "STATUS": "ignore",
                "CATEGORY": "structure",
                "RATIONALE": "Semantics should not just be expressed by formatting text."
            }
        },
        "1.3.4": {
            "1": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Pages with different orientation are allowed as long as this is essential for the content."
            }
        },
        "1.4.3": {
            "1": {
                "STATUS": "error",
                "CATEGORY": "structure",
                "RATIONALE": "Insufficient contrast makes the text difficult to read for people with visual impairments or colour blind people."
            }
        },
        "1.4.4": {
            "1": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Text not be too small, and must be readable when zoomed to 200%."
            }
        },
        "1.4.8": {
            "1": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "The use of fonts that are difficult to read should be avoided (unless it was the intention to make the text difficult to read). Reader software will read the text out correctly, but people with poor vision, ADHD or people in the autism spectrum may have problems reading the text."
            }
        },
        "1.4.10": {
            "1": {
                "STATUS": "warning",
                "CATEGORY": "code",
                "RATIONALE": "A figure which is on one page should have a bounding box."
            }
        },
        "2.4.9": {
            "1": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Links should either have an alternative text or should be associated with text that explains the underlying link. Writing out URLS without alternative text should be avoided."
            }
        },
        "4.1.1": {
            "1": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Merged cells in table bodies should be avoided as much as possible as this makes the table more difficult to read out."
            },
            "2": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Merged cells in table heads should be avoided as much as possible as this makes the table more difficult to read out."
            },
            "3": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Merged cells in table heads should be avoided as much as possible as this makes the table more difficult to read out."
            },
            "4": {
                "STATUS": "critical",
                "CATEGORY": "code",
                "RATIONALE": "A document must be tagged in order to be accessible."
            }
        },
        "4.1.2": {
            "1": {
                "STATUS": "ignore",
                "CATEGORY": "structure",
                "RATIONALE": "If different lines have different formats they shouldn't be marked as a single paragraph."
            },
            "2": {
                "STATUS": "ignore",
                "CATEGORY": "code",
                "RATIONALE": "If different lines of text have different formats they shouldn't be part of the same span."
            },
            "3": {
                "STATUS": "ignore",
                "CATEGORY": "structure",
                "RATIONALE": "Tables should not be used to format text. However, WCAG does allow for tables to be used this way so we'll ignore this warning for the moment."
            },
            "4": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "If something that is not intended as a heading is tagged as a heading, this can confuse reader software for people with visual impairments. It will appear in the contents list as a heading, for example."
            },
            "5": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "If something that is not intended as a heading is tagged as a heading, this can confuse reader software for people with visual impairments. It will appear in the contents list as a heading, for example."
            },
            "6": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Text that is intended as a table row must be tagged as a table element. Otherwise reader software for people with visual impairments will nog recognise it as a table and will fail to read it out correctly."
            },
            "7": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Text that is intended as a table head must be tagged as a table element. Otherwise reader software for people with visual impairments will nog recognise it as a table and will fail to read it out correctly."
            },
            "8": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Text that is intended as a table cell must be tagged as a table element. Otherwise reader software for people with visual impairments will nog recognise it as a table and will fail to read it out correctly."
            },
            "9": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Text that is intended as a part of a table must be tagged as a part of a table. Otherwise reader software for people with visual impairments will nog recognise it as a table and will fail to read it out correctly."
            },
            "10": {
                "STATUS": "ignore",
                "CATEGORY": "structure",
                "RATIONALE": "Text that is intended as a heading must be tagged as a heading. Otherwise reader software for people with visual impairments will not recognise the structure of the document and may have trouble reading it out in the correct order."
            },
            "11": {
                "STATUS": "ignore",
                "CATEGORY": "structure",
                "RATIONALE": "If a span was not intended as a paragraph break, then it should not be tagged as such. Otherwise reader software for people with visual impairments will take this as a new paragraph and read it out as such."
            },
            "12": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Text that is intended as a paragraph must be tagged as a paragraph. Otherwise reader software for people with visual impairments will not recognise the text as a paragraph and may become confused about the reading order if the document."
            },
            "13": {
                "STATUS": "ignore",
                "CATEGORY": "structure",
                "RATIONALE": "Text that is intended as a heading must be tagged as a heading. Otherwise reader software for people with visual impairments will not recognise the text as a heading and may become confused about the reading order if the document."
            },
            "14": {
                "STATUS": "ignore",
                "CATEGORY": "structure",
                "RATIONALE": "Text that is intended as a paragraph must be tagged as a paragraph. Otherwise reader software for people with visual impairments will not recognise the text as a paragraph and may become confused about the reading order if the document."
            },
            "15": {
                "STATUS": "ignore",
                "CATEGORY": "structure",
                "RATIONALE": "Text that is intended as a paragraph must be tagged as a paragraph. Otherwise reader software for people with visual impairments will not recognise the text as a paragraph and may become confused about the reading order if the document."
            },
            "16": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Empty paragraphs can confuse reader software for people with visual impairments. When multiple empty paragraphs are used to create white space in a document, they could be read out explicitly as empty paragraphs which is very disorienting and annoying."
            },
            "17": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Empty spans can confuse reader software for people with visual impairments. When multiple empty spans are used to create white space in a document, they could be read out explicitly as empty lines which is very disorienting and annoying."
            },
            "18": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Empty headings can confuse reader software for people with visual impairments. When multiple empty headings are used to create white space in a document, they could be read out explicitly as empty headings which is very disorienting and annoying."
            },
            "19": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Empty headings can confuse reader software for people with visual impairments. When multiple empty headings are used to create white space in a document, they could be read out explicitly as empty headings which is very disorienting and annoying."
            },
            "20": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Captions must be tagged as such. If not, then reader software for people with visual impairments may not recognise the text as a caption that belongs with the figure."
            },
            "21": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Lists must be formatted and tagged as such. If not, then reader software for people with visual impairments may not recognise the text as a list and may fail to read it out properly."
            },
            "22": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "List structures should be not be used for text which is not a list. And lists should not be interrupted by normal paragraphs."
            },
            "23": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "List structures should be not be used for text which is not a list. And lists should not be interrupted by normal paragraphs."
            },
            "25": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "List structures should be not be used for text which is not a list. And lists should not be interrupted by normal paragraphs."
            },
            "26": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Lists should not be misused to represent tables."
            },
            "27": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Multiple paragraphs should be tagged as such. Line breaks should not be used to delimit paragraphs."
            },
            "28": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Table of content items should be tagged as such."
            },
            "29": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Table of content items should not be empty."
            },
            "30": {
                "STATUS": "warning",
                "CATEGORY": "code",
                "RATIONALE": "Table of content items should point somwhere in the document."
            },
            "31": {
                "STATUS": "warning",
                "CATEGORY": "code",
                "RATIONALE": "Table of content items should point to the right place in the document."
            },
            "32": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Table of content items should be correctly aligned for readability."
            },
            "33": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "Table of contents item should match the heading it refers to."
            },
            "34": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "A single list should be tagged as such and not a series of smaller lists."
            },
            "35": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "A single table of contents should be tagged as such and not a series of tables of contents."
            },
            "36": {
                "STATUS": "warning",
                "CATEGORY": "code",
                "RATIONALE": "The number of table row tags must correspond to the actual amount of table rows."
            },
            "37": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "The number of table column tags must correspond to the actual amount of table columns."
            },
            "38": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "A merged cell must be tagged correctly corresponding to the amount of rows it spans."
            },
            "39": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "A merged cell must be tagged correctly corresponding to the amount of columns it spans."
            },
            "40": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "List items must be tagged as such."
            },
            "41": {
                "STATUS": "warning",
                "CATEGORY": "code",
                "RATIONALE": "The content of a table cell should appear in a position that is coherent with its tag."
            },
            "42": {
                "STATUS": "warning",
                "CATEGORY": "code",
                "RATIONALE": "The content of a table cell should appear in a position that is coherent with its tag."
            },
            "43": {
                "STATUS": "warning",
                "CATEGORY": "code",
                "RATIONALE": "The content of a table cell should appear in a position that is coherent with its tag."
            },
            "44": {
                "STATUS": "warning",
                "CATEGORY": "code",
                "RATIONALE": "The content of a table cell should appear in a position that is coherent with its tag."
            },
            "45": {
                "STATUS": "warning",
                "CATEGORY": "structure",
                "RATIONALE": "A normal table cell should not be tagged as a table head."
            }
        },
        "4.1.3": {
            "1": {
                "STATUS": "error",
                "CATEGORY": "code",
                "RATIONALE": "If content has been tagged inappropriately, reader software for people with visual impairments will not read the document out in the correct way or order."
            }
        }
    }
}